[
  {
    "id": "charkueyteow",
    "name": "Char Kuey Teow",
    "state": "Penang",
    "thumb": "../image/penangkhewtiao.jpg",
        "desc": "Flat rice noodles stir-fried over high heat with a savory blend of soy sauce",
    "tags": [
      "friednoodles",
      "seafoodflavor"
    ],
    "halal": false,
    "image": "../foodImage/CharKueyTeow_2.jpg",
    "introImages": [
      "../foodImage/char_kuey_teow.jpg",
      "../foodImage/charkueyteow_3.jpg"
    ],
    "ingredients": [
      "Fresh Noodles",
      "Fresh Prawns",
      "Soy Sauce",
      "Fresh Egg",
      "Chinese Chives",
      "Blood Cockles"
    ],
    "ingredientsImg": "/FoodDetail/ingredients/charkueyteow_ingredients.png",
    "description_1": [
      "Char Kuey Teow is one of Penang’s most beloved street foods, famous for its smoky “wok hei” aroma. It features flat rice noodles stir-fried over a roaring charcoal flame with fresh prawns, cockles, Chinese sausage, eggs, bean sprouts, and chives. The dark soy sauce blend gives it a rich, slightly sweet-salty taste that is deeply satisfying.",
      " The Chinese term ‘Char kuey teow’ means stir-fried flat rice noodles. It may have originated from China's province Guangdong but various versions of stir-fried rice noodles are found in many Southeast Asian countries. It was first sold by fishermen, farmers and cockle-gatherers throughout Southeast Asia. They used all the leftovers they had to create this dish and sell it to get extra income. ",
      "In West Malaysia, char kuey teow is synonymous with Penang, a state in Malaysia. Today, it is one of the most popular dishes in Malaysia and Singapore. Although it may be just another stir-fried noodles recipe, the tips shared below will definitely help if you aim to have it just like those sold in the Penang hawker center."
     
    ],
    "description_2": [
      
      "The preparation of Char Kuey Teow is an art form, with street vendors mastering the high-heat stir-frying technique to achieve the perfect balance of flavors and textures. The addition of blood cockles and succulent prawns is a signature of the Penang version, making it a must-try dish for any food enthusiast.",
      "While it can be found across Malaysia, the Penang-style Char Kuey Teow is renowned for its intense flavor and generous ingredients. Served on a banana leaf, the dish is a true celebration of the region's culinary heritage."
    ],
    "places": [
      {
        "image": "../places/siamroadcharkoayteow.webp",
        "name": "Village Park",
        "city": "George Town",
        "viewMap": "82,碳炒粿条",
        "descriptionShort": "Roadside wok-fired Char Kuey Teow on Jalan Siam with intense wok-hei.",
        "descriptionFull": "A classic street setup along Jalan Siam serving smoky, high-heat Char Kuey Teow with plump prawns and cockles. Expect charred edges, springy flat noodles, and a deep soy aroma that stays fragrant to the last bite. Stalls fry in small batches, keeping noodles smoky and not oily. Best paired with iced kopi or lime juice.",
        "map": "https://www.google.com/maps/place/%E7%A2%B3%E7%82%92%E7%B2%BF%E6%9D%A1/@5.4148526,100.3184492,17z/data=!3m1!4b1!4m6!3m5!1s0x304ac3b9600a8c6b:0xd12bc6444efbb750!8m2!3d5.4148526!4d100.3210241!16s%2Fg%2F1hc0wtrds?entry=ttu&g_ep=EgoyMDI1MDgxMi4wIKXMDSoASAFQAw%3D%3D",
        "address": "82, Jalan Siam, George Town, 10400 George Town, Pulau Pinang, Malaysia",
        "operationTime": "Opening Hours: 12pm – 6pm (Tues – Sat), Closed Mon, Sun"
      },
      {
        "image": "../places/AhLeng.jpg",
        "name": "Ah Leng Char Koay Teow",
        "city": "George Town",
        "viewMap": "343,Ah Leng",
        "map": "https://maps.google.com/...",
        "descriptionShort": "Old-town style CKT with gentle sweetness and balanced soy.",
         "descriptionFull": "A modest stall famous for a Penang-style fry with lighter sweetness and clean, savory flavors. Fresh bean sprouts and chives keep each plate fragrant and satisfying. Old enamel plates and a single roaring wok set the vibe. Ask for extra bean sprouts if you want more crunch." ,
         "address": "343, Jalan Dato Keramat, Kampung Makam, 10150 George Town, Pulau Pinang",
          "operationTime": "Opening Hours: 11am – 4pm (Fri – Tue), Closed Wed,Thr"
      },
      {
        "image": "../places/newworld.jpg",
        "name": "New World Park Food Court",
        "city": "George Town",
        "viewMap": "29,New World Park",
        "map": "https://www.google.com/maps/place/%E6%96%B0%E4%B8%96%E7%95%8C%E7%BE%8E%E9%A3%9F%E5%9F%8E/@5.4211535,100.3243183,17z/data=!3m1!4b1!4m6!3m5!1s0x304ac3a2a8ad5ca1:0xa39bcc6f837174d5!8m2!3d5.4211535!4d100.3268932!16s%2Fg%2F11f4qf053g?entry=ttu&g_ep=EgoyMDI1MDgxMi4wIKXMDSoASAFQAw%3D%3D",
        "descriptionShort": "Comfortable food-court CKT with consistent wok-hei.",
        "descriptionFull": "Air-conditioned seating and steady execution make this a reliable Char Kuey Teow stop. Noodles are well-seared, seafood is fresh, and service is quick even during peak hours. Choose prawn-only or add cockles on request. Plenty of seating makes it easy for groups.",
        "address":"29, Lrg Swatow, George Town, 10050 George Town, Pulau Pinang",
        "operationTime":" Opening Hours: 10am - 10pm"
      } 
    ]
  },
  
  {
    "id": "hokkienmee",
    "name": "Hokkien Mee",
    "state": "Penang",
    "thumb": "../image/Penang-Prawn-Mee-Wide.jpg",
    "desc": "Vibrant noodle soup renowned for its intensely flavorful and spicy broth",
    "tags": ["noodles", "prawns"],
    "halal": false,
    "image": "../foodImage/hokkienmee_1.jpg",
    "introImages": [
      "../foodImage/hokkienmee_2.jpg",
      "../foodImage/hokkienmee_3.jpg"
    ],
    "description_1": [
      "Hokkien Mee is a prawn noodle soup rich with intense seafood flavors and dark soy sauce. It combines yellow noodles and rice vermicelli, garnished with pork, prawns, and boiled eggs.",
      "The broth is made by simmering prawn heads and shells for hours, resulting in a rich and savory base that complements the noodles perfectly.",
      "Often served with sambal chili and a squeeze of lime, this dish balances spicy, sour, and umami flavors."
    ],
    "description_2": [
      "Traditionally a breakfast staple, Hokkien Mee remains a favorite among locals and tourists for its hearty and satisfying qualities.",
      "Every stall has its secret recipe, with variations in noodle ratios and broth richness.",
      "It is best enjoyed hot and fresh from the wok, capturing the essence of Penang's culinary heritage."
    ],
    "ingredients": [
      "Yellow noodles",
      "Rice vermicelli",
      "Prawns",
      "Pork slices",
      "Boiled eggs",
      "Dark soy sauce",
      "Sambal chili"
    ],
    "places": [
      {
        "image": "../places/AhSoonPrawnMee.jpg",
        "name": "Ah Soon Prawn Mee",
        "city": "George Town",
        "viewMap": "168,Ah Soon",
        "descriptionShort": "Rich prawn broth with generous toppings.",
        "descriptionFull": "A Penang favorite for deep, shell-forward prawn stock and springy noodles. Slices of pork, prawns, and egg round out a bowl that’s hearty without being heavy. They simmer prawn heads daily so the broth stays punchy. House-made chili paste is especially aromatic.",
        "address": "168, Jln Macalister, SinKim san, 10400 George Town, Pulau Pinang",
        "operationTime": "7am – 1pm daily, Mon rest",
        "map": "https://maps.app.goo.gl/5gTz2ckCRDPaQeWH8"
      },
      {
        "image": "../places/fattKee.jpeg",
        "name": "Restoran Fatt Kee",
        "city": "George Town",
        "viewMap": "1228,Fatt Kee",
        "descriptionShort": "Hearty, seafood-intense prawn mee done old-school.",
        "descriptionFull": "Known for a robust, umami-packed broth and well-balanced spice. The noodle texture holds up beautifully from first sip to last. Thin pork slices add sweetness without overpowering the prawns. Refills of soup are usually possible if you ask.",
        "address": "1228-S, Jln Paya Terubung, Farlim, 11060 Air Itam, Penang",
        "operationTime": "7am – 10pm daily, Mon rest",
        "map": "https://maps.app.goo.gl/ZVTNzR5PwFCkKXpL8"
      },
      {
        "image": "../places/kopisengthor.jpg",
        "name": "Kedai Kopi Seng Thor",
        "city": "George Town",
        "viewMap": "160,Seng Thor",
        "descriptionShort": "Classic kopitiam prawn mee with nostalgic flavors.",
        "descriptionFull": "A breakfast go-to offering clean, aromatic broth and fresh toppings. Simple, satisfying, and quintessentially Penang. Most regulars stir in sambal halfway through the bowl. Portion size is just right for breakfast.",
        "address": "160, Lebuh Carnarvon, George Town, 10100 George Town, Pulau Pinang",
        "operationTime": "7am – 2pm daily, Wed rest",
        "map": "https://maps.app.goo.gl/ZmYDnrrh98Mtd2Yp7"
      }
    ]
  },
  {
    "id": "tarorice",
    "name": "Taro Rice",
    "state": "Penang",
    "thumb": "../image/YamRice.jpg",
    "desc": "Rice cooked with diced yam (taro)",
    "tags": ["dessert", "snack"],
    "halal": true,
    "image": "../foodImage/tarorice_1.jpeg",
    "introImages": [
      "../foodImage/tarorice_2.jpg",
      "../foodImage/tarorice_3.jpg"
    ],
    "description_1": [
      "Taro Rice is a beloved Penang dessert made from glutinous rice topped with smooth, creamy taro paste. This dish offers a comforting sweetness balanced with the subtle fragrance of taro.",
      "Traditionally served warm or chilled, it has become a favorite snack for locals after meals or as a mid-day treat.",
      "The simplicity of the ingredients highlights authentic preparation techniques passed down through generations."
    ],
    "description_2": [
      "The glutinous rice is perfectly cooked to be sticky but tender, complemented by rich taro paste made from fresh tubers and coconut milk.",
      "Often sold at market stalls, taro rice showcases Penang’s love for natural, wholesome ingredients.",
      "Its wholesome texture and natural sweetness make it a refreshing alternative to heavier desserts."
    ],
    "ingredients": [
      "Glutinous rice",
      "Fresh taro",
      "Coconut milk",
      "Sugar"
    ],
    "places": [
      {
        "image": "../places/chipheng.jpg",
        "name": "Yam Rice Chip Heng",
        "city": "Pulau Pinang",
        "viewMap": "45,Chip Heng",
        "descriptionShort": "Creamy taro paste over perfectly sticky rice.",
        "descriptionFull": "Smooth, coconut-kissed taro sits atop glutinous rice cooked to a tender, cohesive bite. A timeless dessert that’s gentle, fragrant, and comforting. Taro is steamed fresh in small batches. Light coconut fragrance keeps it from feeling heavy.",
        "address": "45, Lebuh Kurau 1, Taman Chai Leng, 13700 Perai, Pulau Pinang, Malaysia",
        "operationTime": "10am – 2:30pm daily, Thu & Fri Rest",
        "map": "https://maps.app.goo.gl/z6o4aVGFMQAKbksi6"
      },
      {
        "image": "../places/bmyamrice.jpg",
        "name": "BM Yam Rice Kopitiam",
        "city": "Pulau Pinang",
        "viewMap": "7,BM Yam Rice",
        "descriptionShort": "Market-style taro rice with familiar homemade taste.",
        "descriptionFull": "Loved for its silky taro paste and balanced sweetness. Portions are generous and great for a mid-day treat. They sometimes finish with toasted sesame for aroma. Great with hot tea after a salty main.",
        "address": "7, Jalan Murthy, 14000 Bukit Mertajam, Pulau Pinang",
        "operationTime": "9am – 3pm daily,Thu rest & Sun 2pm closed ",
        "map": "https://maps.app.goo.gl/mdzHuj99NgVSojCr7"
      },
      {
        "image": "../places/zhengxiang.jpeg",
        "name": "Zheng Xiang Yam Rice",
        "city": "George Town",
        "viewMap": "11,Zheng Xiang",
        "descriptionShort": "Traditional yam rice with careful, balanced richness.",
        "descriptionFull": "Taro paste is smooth without being heavy, pairing well with warm, chewy rice. A dependable stop for fans of classic Penang desserts. Texture leans smooth rather than chunky. A portion is easy to share as a gentle dessert.",
        "address": "11, Jalan Rangoon, 11450 George Town, Pulau Pinang",
        "operationTime": "10am – 3pm,5:00pm - 9pm daily,Thu closed",
        "map": "https://maps.app.goo.gl/g4kbEbuB6CwqP4wk6"
      }
    ]
  },
  {
    "id": "rojak",
    "name": "Rojak",
    "state": "Penang",
    "thumb": "../image/rojak.jpg",
    "desc": "Dessert with fruit and sweet sos",
    "tags": ["salad", "fruit", "spicy"],
    "halal": true,
    "image": "../foodImage/rojak_1.jpg",
    "introImages": [
      "../foodImage/rojak_2.jpg",
      "../foodImage/rojak_3.jpg"
    ],
    "description_1": [
      "Penang Rojak is a refreshing fruit and vegetable salad tossed with a thick, spicy prawn paste sauce. It combines pineapple, cucumber, jicama, tofu, and fried dough fritters to create a medley of textures.",
      "The balance of sweet, spicy, and savory flavors makes it a popular snack at markets and food stalls.",
      "It is a dish that showcases the diverse culinary influences and fresh produce of Penang."
    ],
    "description_2": [
      "Each component adds a distinct taste and texture, contrasted beautifully by the umami-laden spicy sauce.",
      "Frequently enjoyed as a light meal, Penang Rojak is loved for its bright flavors and simplicity.",
      "The traditional preparation method and fresh ingredients keep this dish vibrant and satisfying."
    ],
    "ingredients": [
      "Pineapple",
      "Cucumber",
      "Jicama",
      "Tofu",
      "Fried dough fritters",
      "Prawn paste",
      "Chili",
      "Peanuts"
    ],
    "places": [
      {
        "image": "../places/hockseng.jpg",
        "name": "Hock Seng Rojak",
        "city": "George Town",
        "viewMap": "Lbg Cecil, Hock Seng",
        "descriptionShort": "Punchy prawn-paste rojak with fresh crunch.",
        "descriptionFull": "A beloved stall serving bright, tangy-sweet sauce over crisp fruit and fritters. The peanut finish adds depth without overpowering. Pineapple is cut to order to keep the salad crisp. Thickened prawn paste helps the sauce cling well.",
        "address": "Gat Lbh Cecil, 10300 George Town, Pulau Pinang",
        "operationTime": "Thu - Sun 6pm – 10pm",
        "map": "https://maps.app.goo.gl/j2waqu4mwUcMjcpr5"
      },
      {
        "image": "../places/howeiheng.jpg",
        "name": "Rojak Ho Wei Heng",
        "city": "George Town",
        "viewMap": "11, Ho Wei Heng",
        "descriptionShort": "Traditional market rojak with balanced sweetness.",
        "descriptionFull": "Known for fresh cut ingredients and a well-rounded sauce that’s spicy, savory, and lightly sweet. Ideal for a quick, refreshing bite. Fritters arrive warm for extra crunch. Say 'kurang manis' if you prefer it less sweet.",
        "address": "Medan Renong, 11, Jalan Tun Syed Sheh Barakbah, George Town, 10200 George Town, Pulau Pinang",
        "operationTime": "Tue - Sat 6pm – 11pm daily",
        "map": "https://maps.app.goo.gl/ttcXgNdgMmpqVzxs9"
      },
      {
        "image": "../places/kareemPasembur.jpg",
        "name": "Kareem Pasembur Rojak",
        "city": "George Town",
        "viewMap":"7,Kareem",
        "descriptionShort": "Bold, saucy pasembur with generous toppings.",
        "descriptionFull": "Crispy fritters, tofu, and vegetables are coated in a robust, nutty gravy. A hearty, flavorful plate that fills and satisfies. Pick your add‑ons from a long counter and pay by weight. The gravy leans spicy‑sweet with a hint of cinnamon.",
        "address": "7, Lebuh Union, George Town, 10200 George Town, Pulau Pinang",
        "operationTime": "Mon - Sat 11am – 6pm daily",
        "map": "https://maps.app.goo.gl/Sh9RMMR7HXAwWrQX7"
      }
    ]
  },



  {
    "id": "beansproutchicken",
    "name": "Bean Sprout Chicken",
    "state": "Perak",
    "thumb": "../image/chicken.jpg",
    "desc": "poached chicken and crunchy bean sprouts with a soy sauce and sesame oil",
    "tags": ["chicken", "bean sprouts"],
    "halal": true,
    "image": "../foodImage/beansproutchicken_1.jpeg",
    "introImages": [
      "../foodImage/beansproutchicken_2.jpeg",
      "../foodImage/beansproutchicken_3.jpg"
    ],
    "description_1": [
      "Bean Sprout Chicken is a classic dish from Perak, well-known for its tender poached chicken served on a bed of crunchy, fresh bean sprouts. The chicken is boiled gently to retain its succulent texture and natural flavors.",
      "Typically, it is accompanied by fragrant chicken rice and a tangy ginger chili sauce, creating a harmonious balance of tastes that delight the palate.",
      "This dish represents the simple yet refined culinary traditions of Ipoh, the state capital, where it is a local favorite and cultural icon."
    ],
    "description_2": [
      "Freshness is key in this dish, with bean sprouts either steamed or blanched to maintain their crispiness and natural sweetness.",
      "The chicken, often served with the skin on, is lightly seasoned and served warm, complementing the mild vegetable base perfectly.",
      "Visiting Ipoh without sampling Bean Sprout Chicken is considered incomplete by many food enthusiasts who admire its pure and wholesome flavors."
    ],
    "ingredients": [
      "Chicken",
      "Fresh bean sprouts",
      "Ginger",
      "Chili sauce",
      "Rice"
    ],
   "places": [
      {
        "image": "../places/louWong.jpg",
        "name": "Lou Wong Bean Sprout Chicken",
        "city": "Ipoh",
        "viewMap": "49, Lou Wang",
        "descriptionShort": "Silky chicken with famously crunchy sprouts.",
        "descriptionFull": "An Ipoh icon serving poached chicken with glistening skin and snap-fresh taugeh. Best enjoyed with fragrant rice and zingy chili-ginger dips. Table turnover is fast and you may share tables at peak times. Offal options are available if you like livers and gizzards.",
        "address": "49 Jalan Yau Tet Shin, Ipoh, Perak, Malaysia",
        "operationTime": "10am – 10pm daily",
        "map": "https://maps.app.goo.gl/SxwWHrdECXKjhAQ76"
      },
      {
        "image": "../places/yoonKee.jpeg",
        "name": "Yoon Kee Bean Sprout Chicken",
        "city": "Ipoh",
        "viewMap": "23, Yoon Kee",
        "descriptionShort": "Tender chicken, aromatic rice, crisp taugeh.",
        "descriptionFull": "Balanced seasoning, consistent texture, and bright chili sauce make this a dependable Ipoh bean sprout chicken stop. Rice is lightly oiled so it stays fluffy. A small soup on the side rounds out the meal.",
        "address": "No 23, Medan Selera Stadium, Jalan Kompleks Sukan, Kompleks Sukan Ipoh, 31400 Ipoh, Perak",
        "operationTime": "5pm – 10:30pm daily, Thu rests",
        "map": "https://maps.app.goo.gl/eEeWmhXxXyMBezdt5"
      },
      {
        "image": "../places/mountainTop.jpeg",
        "name": "Mountain Top Bean Sprout Chicken",
        "city": "Ipoh",
        "viewMap": "568, Mountain Top",
        "descriptionShort": "Classic Ipoh chicken rice in a family-friendly setting.",
        "descriptionFull": "Moist slices of chicken pair with crunchy sprouts and light, flavorful rice. A comfortable choice for groups and families. Parking is easier here than in old town. Staff can portion platters for sharing.",
        "address": "568, Jln. Kuala Kangsar, Kampung Tawas, 30010 Ipoh, Perak",
        "operationTime": "11am – 9pm daily",
        "map": "https://maps.app.goo.gl/w7wNjvwWraHWoQ8g8"
      }
    ]
  },
  {
    "id": "cheecheongfun",
    "name": "Chee Cheong Fun",
    "state": "Perak",
    "thumb": "../image/Chee.jpg",
    "desc": "Silky, thicker noodles served with a variety of sauces",
    "tags": ["rice noodle", "dim sum"],
    "halal": true,
    "image": "../foodImage/cheecheongfun_1.jpg",
    "introImages": [
      "../foodImage/cheecheongfun_2.jpg",
      "../foodImage/cheecheongfun_3.jpg"
    ],
    "description_1": [
      "Chee Cheong Fun is a silky, steamed rice noodle roll popular as a breakfast or snack in Perak. Made from rice flour, these rolls are thin and smooth, providing a delicate texture to the dish.",
      "Served with a variety of condiments such as hoisin sauce, sesame seeds, and sometimes dried shrimp or fried shallots, the dish offers layers of flavor with every bite.",
      "This dish showcases the fine balance between softness and flavor, widely appreciated in Perak’s dim sum culture."
    ],
    "description_2": [
      "Variations include filling the rolls with shrimp or pork, adding a savory surprise inside the delicate wrapper.",
      "The sauces enhance the natural sweetness of the rice noodle while adding an aromatic touch.",
      "Chee Cheong Fun remains a beloved comfort food, perfect for any time of day."
    ],
    "ingredients": [
      "Rice flour",
      "Water",
      "Hoisin sauce",
      "Sesame seeds",
      "Fried shallots"
    ],
    "places": [
      {
        "image": "../places/restaurantNewHollywood.webp",
        "name": "New Hollywood Restaurant",
        "city": "Ipoh",
        "viewMap": "38, New Hollywood",
        "descriptionShort": "Silky rice rolls with time-honored sauces.",
        "descriptionFull": "Thin, smooth sheets arrive warm with hoisin, chili, and sesame. A crowd-pleaser that highlights texture and subtlety. The shrimp‑paste option is fragrant yet mild. Lines are shortest before 9 AM.",
        "address": "38, Lorong Cecil Rae, Taman Canning, 31400 Ipoh, Perak",
        "operationTime": "7am – 6pm daily",
        "map": "https://maps.app.goo.gl/7uTAFMN69vaKCUuA9"
      },
      {
        "image": "../places/pasirPinji.jpg",
        "name": "Pasir Pinji Chee Cheong Fun",
        "city": "Ipoh",
        "viewMap": "1456, Pasir Pinji",
        "descriptionShort": "Humble, tasty rolls at fair prices.",
        "descriptionFull": "Freshly steamed rice rolls topped with aromatic sauces and crispy shallots. Comforting and straightforward. They offer both rolled and cut styles—rolled holds sauce better. Chili is tangy rather than fiery.",
        "address": "1456, Jln Pasir Pinji 5, Kampung Pasir Pinji Baru, 31650 Ipoh, Perak",
        "operationTime": "Mon- Tue & Wed - Thu 10am - 3pm",
        "map": "https://maps.app.goo.gl/78XjLB3Go2oRXNiC9"
      },
      {
        "image": "../places/yumCha.jpeg",
        "name": "Yum Cha House Dim Sum",
        "city": "Ipoh",
        "viewMap": "79A, Yum Cha House",
        "descriptionShort": "Dim sum spot known for soft, delicate CCF.",
        "descriptionFull": "Gentle rice sheets with balanced sweet-savory condiments. A light option among classic dim sum offerings. Order the prawn version for more bite. Soy is light; add extra at the table if you prefer.",
        "address": "79A, Jalan C.M. Yusuff, 30250 Ipoh, Perak",
        "operationTime": "6:30am – 2:30pm daily, Tue rest",
        "map": "https://maps.app.goo.gl/jhPAyKm35CdHxhC2A"
      }
    ]
  },
  {
    "id": "chickencurrybread",
    "name": "Chicken Curry Bread",
    "state": "Perak",
    "thumb": "../image/currychickenbread.jpg",
    "desc": "Chicken curry baked within a large, soft and slightly sweet bread loaf",
    "tags": ["curry", "bread", "snack"],
    "halal": false,
    "image": "../foodImage/chickencurrybread_1.jpg",
    "introImages": [
      "../foodImage/chickencurrybread_2.jpg",
      "../foodImage/chickencurrybread_3.jpg"
    ],
    "description_1": [
      "Chicken Curry Bread is a popular Perak snack featuring crispy fried bread stuffed with rich, spicy chicken curry. The bread is wrapped tightly around the flavorful curry to encase it in a crunchy crust.",
      "A perfect blend of textures, the crispy exterior complements the tender chicken and robust curry filling exceptionally well.",
      "This snack is beloved by locals for mid-day cravings or as a hearty accompaniment to tea."
    ],
    "description_2": [
      "The curry itself is made with a blend of aromatic herbs and spices simmered slowly to infuse flavors deeply into the chicken.",
      "Fried to golden perfection, the bread provides a satisfying crunch while sealing in the moist curry inside.",
      "Chicken Curry Bread is a testament to Perak’s rich snack culture combining traditional curry flavors with innovative baking."
    ],
    "ingredients": [
      "Bread dough",
      "Chicken curry",
      "Spices",
      "Onions",
      "Garlic"
    ],
    "places": [
      {
        "image": "../places/gbCurryBun.jpg",
        "name": "GB Curry Bun",
        "city": "Ipoh",
        "viewMap": "63, GB",
        "descriptionShort": "Golden, crisp bun stuffed with savory curry.",
        "descriptionFull": "The shell is crunchy while the chicken curry inside stays moist and aromatic. A fun, shareable snack with a satisfying bite. The crust stays crisp even after the first tear. Best split between three or four people.",
        "address": "No 63, (Ground Floor, Jalan Theatre, Taman Jubilee, 30300 Ipoh, Perak",
        "operationTime": "10:30am – 7:30pm daily",
        "map": "https://maps.app.goo.gl/feVq51tF2HaE2rWL9"
      },
      {
        "image": "../places/chenKee.jpeg",
        "name": "Chen Kee No Coconut Milk Curry Chicken Bread",
        "city": "Ipoh",
        "viewMap": "180, Chen Kee",
        "descriptionShort": "Fragrant curry bun with clean, spice-forward profile.",
        "descriptionFull": "Rich spices shine without heaviness, wrapped in a flaky, crisp crust. Great for takeaway or a quick tea-time fix. Spice aroma leans toward star anise and clove. Slightly drier curry that’s great for dipping.",
        "address": "180 Jalan Gunung Rapat, Taman Rapat Setia, 31350 Ipoh, Perak",
        "operationTime": "Tue & Thu & Weekend 10am – 6pm",
        "map": "https://maps.app.goo.gl/Fr6bx6pRX25jAS1w7"
      },
      {
        "image": "../places/yauKee.jpg",
        "name": "Yau Kee (Roti Ayam) Restaurant",
        "city": "Kampar",
        "viewMap": "55 & 57, Yau Kee",
        "descriptionShort": "Kampar’s beloved whole curry bun experience.",
        "descriptionFull": "Tear into the loaf to reveal a hearty chicken curry center. A signature, old-school treat that’s fun for the table. Pre‑orders help avoid sell‑outs on weekends. The dramatic 'open the loaf' moment is part of the fun.",
        "address": "55 & 57, Jln Idris, Kampung Masjid, 31900 Kampar, Perak",
        "operationTime": "7am – 9:30pm daily",
        "map": "https://maps.app.goo.gl/oXh25TBbiSkqGDQw5"
      }
    ]
  },
  {
    "id": "chickenhorfun",
    "name": "Chicken Hor Fun",
    "state": "Perak",
    "thumb": "../image/ShreddedChickenKueyTeow.jpg",
    "desc": "Silky flat rice noodles",
    "tags": ["noodles", "chicken"],
    "halal": false,
    "image": "../foodImage/chickenhorfun_1.jpg",
    "introImages": [
      "../foodImage/chickenhorfun_2.jpg",
      "../foodImage/chickenhorfun_3.jpg"
    ],
    "description_1": [
      "Chicken Hor Fun is a beloved noodle dish consisting of flat rice noodles stir-fried with tender chicken slices, bean sprouts, and chives. It is a light but flavorful meal common in Perak’s street food scene.",
      "Typically cooked with garlic and light soy sauce, this dish delivers aromatic and savory notes.",
      "The silky smooth noodles combined with fresh ingredients make it an inviting comfort food enjoyed by people of all ages."
    ],
    "description_2": [
      "Often garnished with deep-fried shallots or crispy bits, Chicken Hor Fun has a wonderful textural contrast.",
      "The dish is usually served hot, with complementary chili sauces on the side for those who prefer it spicy.",
      "It epitomizes the simple, hearty, and delicious nature of Perak’s local noodle offerings."
    ],
    "ingredients": [
      "Flat rice noodles",
      "Chicken",
      "Bean sprouts",
      "Garlic",
      "Light soy sauce",
      "Shallots"
    ],
     "places": [
      {
        "image": "../places/littlePaloh.jpg",
        "name": "Little Paloh Kopitiam",
        "city": "Ipoh",
        "viewMap": "71, Little Paloh",
        "descriptionShort": "Smooth hor fun with tender chicken slices.",
        "descriptionFull": "Light soy and garlic bring out the noodle’s silkiness, topped with crunchy sprouts and fried shallots. Comforting and aromatic. Soup is clean with gentle chicken notes. A drizzle of garlic oil lifts the aroma.",
        "address": "71, Hala Medan Lagenda 1, Lapangan Permai, 31350 Ipoh, Perak",
        "operationTime": "6am – 10pm daily",
        "map": "https://maps.app.goo.gl/9bwWwdC6qqNUitvz9"
      },
      {
        "image": "../places/restoranVegas.jpg",
        "name": "Restoran Vegas",
        "city": "Ipoh",
        "viewMap": "1,Restoran Vegas",
        "descriptionShort": "Well-seasoned hor fun cooked to order.",
        "descriptionFull": "Balanced wok aroma, clean flavors, and fresh toppings. A cozy spot for a warm, satisfying plate. Flat noodles glide well without sticking. Pickled green chilies add brightness.",
        "address": "1, Lorong Cecil Rae, Canning Garden, 31400 Ipoh, Perak",
        "operationTime": "6：30am – 9：30pm daily",
        "map": "https://maps.app.goo.gl/JXqLoqVcGz131rAq7"
      },
      {
        "image": "../places/dongTai.webp",
        "name": "Dong Tai Kopitiam Pasir Pinji",
        "city": "Ipoh",
        "viewMap": "46, Dong Tai",
        "descriptionShort": "Traditional recipe with steady, familiar taste.",
        "descriptionFull": "Soft rice noodles, juicy chicken, and gentle seasoning make this a dependable choice for hor fun lovers. Broth is gentle and family‑friendly. Service is quick even at lunch.",
        "address": "46 (Ground Floor, Jalan Foo Eng Lin, Taman Hoover, 31650 Ipoh, Perak",
        "operationTime": "8am – 6pm daily",
        "map": "https://maps.app.goo.gl/j4R53iR1YUV9U1Nn6"
      }
    ]
  },


  {
    "id": "kampua",
    "name": "Kampua",
    "state": "Sarawak",
    "thumb": "../image/kampua1.jpg",
    "desc": "Straight egg noodles tossed in a simple yet flavorful sauce",
    "tags": ["noodles", "pork"],
    "halal": false,
    "image": "../foodImage/kampua_1.jpg",
    "introImages": [
      "../foodImage/kampua_2.jpg",
      "../foodImage/kampua_3.jpg"
    ],
    "description_1": [
      "Kampua is a traditional Sarawak noodle dish featuring dry white noodles tossed with pork fat, garlic oil, and soy sauce. The simplicity of the seasoning brings out the natural flavors of the noodles and pork.",
      "Often accompanied by slices of char siew (barbecued pork), this dish is a staple comfort food within the Foochow Chinese community in Sarawak.",
      "Its origins date back generations, showcasing a humble yet satisfying meal loved by locals across Kuching and beyond."
    ],
    "description_2": [
      "The noodles are cooked to tender perfection and then quickly tossed in aromatic oils, providing a silky texture and rich flavor.",
      "Additional toppings like green onions or fried shallots add freshness and crunch to balance the richness of the pork fat.",
      "Kampua continues to be a beloved dish that reflects the cultural heritage and culinary traditions of Sarawak."
    ],
    "ingredients": [
      "Egg noodles",
      "Pork fat oil",
      "Garlic",
      "Soy sauce",
      "Barbecued pork (char siew)",
      "Green onions"
    ],
   "places": [
      {
        "image": "../places/noodleHouse.jpg",
        "name": "Restoran Noodle House",
        "city": "Sibu",
        "viewMap": "Lor Laichee 1",
        "descriptionShort": "Silky kampua tossed in aromatic oils.",
        "descriptionFull": "Springy noodles shine with garlic and lard oil, finished with char siew and scallions. Simple, fragrant, and deeply satisfying. Char siew runs on the sweeter side. Ask for extra shallot oil if you like it richer.",
        "address": "Lor Laichee 1, Sibu, 96000 Sibu, Sarawak",
        "operationTime": "8am – 10pm daily",
        "map": "https://maps.app.goo.gl/aLZLp2Tm7Wxa1hBW8"
      },
      {
        "image": "../places/sadiqin.jpg",
        "name": "Sadiqin Lim Kampua & Bak Kut Teh",
        "city": "Kuching",
        "viewMap": "Batu Lintang, Sadiqin Liml",
        "descriptionShort": "Classic Foochow kampua in a casual setting.",
        "descriptionFull": "Light seasoning lets the noodle texture lead, with gentle pork notes and a sprinkle of greens for freshness. Noodles are slightly thicker and springy. Pair with a small soup for balance.",
        "address": "Batu Lintang Food Court, 93150 Kuching, Sarawak",
        "operationTime": "7am – 12pm daily",
        "map": "https://maps.app.goo.gl/jXQncQZ8jnyoaweu8"
      },
      {
        "image": "../places/songCorner.jpg",
        "name": "Song Corner",
        "city": "Kuching",
        "viewMap": "1447, Song Corner",
        "descriptionShort": "Quick, tasty kampua with consistent bite.",
        "descriptionFull": "Noodles are tender yet bouncy, lightly dressed and finished with char siew. Ideal for a fast, fuss-free meal. Portions are generous for the price. The 'black' version adds a touch of caramel.",
        "address": "1447, Lorong Song 4B, Tabuan Heights, 93350 Kuching, Sarawak",
        "operationTime": "6:10am – 9:25pm daily , Thu rest",
        "map": "https://maps.app.goo.gl/MyNz4LFKqk7yEpWY8"
      }
    ]
  },
  {
    "id": "kompyang",
    "name": "Kompyang",
    "state": "Sarawak",
    "thumb": "../image/gongbia.jpg",
    "desc": "Traditional baked bread with a savory minced pork filling",
    "tags": ["bread", "breakfast"],
    "halal": true,
    "image": "../foodImage/kompyang_1.jpg",
    "introImages": [
      "../foodImage/kompyang_2.jpg",
      "../foodImage/kompyang_3.jpg"
    ],
    "description_1": [
      "Kompyang is a traditional Sarawak bread roll with savory fillings such as curry chicken or sardine. It is soft on the inside with a slightly crispy exterior.",
      "Commonly eaten for breakfast, this snack pairs exceptionally well with local kopi (coffee) for a fulfilling start to the day.",
      "The bread is filled generously and often handmade fresh daily to keep the texture light and flavors rich.",
       "Varieties of fillings make Kompyang a versatile favorite, allowing for both hearty and lighter options depending on taste."
    ],
    "description_2": [
     
      "The perfect balance between the soft bread and flavorful fillings makes it a comfort food treasured throughout Sarawak.",
      "Its popularity continues to grow as street vendors and cafes keep this tradition alive."
    ],
    "ingredients": [
      "Bread dough",
      "Meat or curry filling",
      "Spices",
      "Onions",
      "Garlic"
    ],
     "places": [
      {
        "image": "../places/sengWang.JPG",
        "name": "Seng Wan Bakery",
        "city": "Sibu",
        "viewMap": "22, Seng Wan",
        "descriptionShort": "Freshly baked kompyang with savory fillings.",
        "descriptionFull": "Soft, slightly crisp rolls cradle curry or sardine fillings that are warm and flavorful. A beloved breakfast staple. Sesame‑studded tops add fragrance. Try the plain version warmed for a simple snack.",
        "address": "22, Lor Rejang Park 3, Sibu, 96000 Sibu, Sarawak",
        "operationTime": "6am - 1pm daily, Wed rest",
        "map": "https://maps.app.goo.gl/dxihLtkTM1kU2gfP7s"
      },
      {
        "image": "../places/kompiaHouse.jpg",
        "name": "Kompia House",
        "city": "Kuching",
        "viewMap": "203, Kompia House",
        "descriptionShort": "Popular morning stop for hot kompyang and kopi.",
        "descriptionFull": "Handmade rolls come out throughout the day, with fillings that balance spice and savoriness. Perfect with strong local coffee. Fillings rotate through the day—ask what’s hot. The slight chew makes it satisfying.",
        "address": "203, Lorong Matang Jaya 6, Taman Matang Jaya, 93050 Kuching, Sarawak",
        "operationTime": "11am – 6pm daily, Fri rest",
        "map": "https://maps.app.goo.gl/UeAmUcHdbGcxnUEw6"
      },
      {
        "image": "../places/songKhengHai.jpg",
        "name": "Pusat Makanan Dan Rekreasi Padang Song Kheng Hai",
        "city": "Kuching",
        "viewMap": "Pusat Song Kheng Hai",
        "descriptionShort": "Hawker center rolls with generous stuffing.",
        "descriptionFull": "Multiple stalls offer soft, warm kompyang with hearty fillings. Casual, lively, and great for snacking. Vendors can toast the rolls on request for extra crisp. Ideal as a walking snack.",
        "address": "Jalan Song Kheng Hai, 93100 Kuching, Sarawak",
        "operationTime": "11:30am – 5pm daily",
        "map": "https://maps.app.goo.gl/p6R6ZYN5JBzuQ5V47"
      }
    ]
  },
  {
    "id": "dingbianhu",
    "name": "Ding Bian Hu",
    "state": "Sarawak",
    "thumb": "../image/FoochowDelicacies.jpg",
    "desc": "Foochow dish with broth is made from a pork and cuttlefish stock",
    "tags": ["rice", "soup"],
    "halal": false,
    "image": "../foodImage/dingbianhu_1.jpg",
    "introImages": [
      "../foodImage/Dingbianhu_2.jpg",
      "../foodImage/dingbianhu_3.jpg"
    ],
    "description_1": [
      "Ding Bian Hu is a unique Sarawak dish featuring rice flour batter cooked on the side of a hot wok and mixed with savory broth and fresh ingredients. It creates a silky smooth texture with slight smoky notes.",
      "Widely regarded as a traditional Foochow specialty, it combines thickened rice soup enriched with toppings like pork, prawns, or fish balls.",
      "This dish is beloved for its comforting warmth and complex textures that are distinctive to Sarawak’s culinary landscape."
    ],
    "description_2": [
      "The cooking technique of ‘wok side batter’ is unique, requiring skill to create just the right consistency without overcooking.",
      "Toppings vary but often include fresh herbs and crunchy fried shallots to create a layered sensory experience.",
      "Ding Bian Hu symbolizes the deep-rooted food traditions and innovation found in Sarawak's kitchens."
    ],
    "ingredients": [
      "Rice flour batter",
      "Broth",
      "Pork slices",
      "Prawns",
      "Fish balls",
      "Herbs"
    ],
   "places": [
      {
        "image": "../places/treasureLand.png",
        "name": "Treasure Land",
        "city": "Sibu",
        "viewMap": "Treasure Land",
        "descriptionShort": "Authentic, silky ding bian hu with rich broth.",
        "descriptionFull": "Thin sheets of rice batter slide into a savory soup topped with pork, prawns, and herbs. Comforting and uniquely Foochow. Rice batter is shaved straight into the pot for silky sheets. Peppery notes build slowly.",
        "address": "Jalan Ling Kai Cheng, Pekan Sibu, 96000 Sibu, Sarawak",
        "operationTime": "7:15am – 11:30am daily, Thu - Sat 6:00am - 8:00pm reopen ",
        "map": "https://maps.app.goo.gl/QBiJ8PcYo6pJUSY36"
      },
      {
        "image": "../places/jongHua.jpeg",
        "name": "Jong Hua Kopitiam",
        "city": "Kuching",
        "viewMap": "22,Jong Hua",
        "descriptionShort": "Smooth batter ribbons in a flavorful soup.",
        "descriptionFull": "A textbook bowl with balanced seasoning and a garnish of fried shallots for aroma and crunch. A light seafood sweetness carries the broth. Fried shallots add a welcome crunch.",
        "address": "No.22, Lot 1041B, Tabuan Stutong Commercial Centre, Jalan Setia Raja, Tabuan Laru, 93350 Kuching, Sarawak",
        "operationTime": "7am – 12pm daily, Mon rest",
        "map": "https://maps.app.goo.gl/pRzmXxdtZsc3u2Re7"
      },
      {
        "image": "../places/xinFuZhou.jpg",
        "name": "Xin Fu Zhou Cafe",
        "city": "Kuching",
        "viewMap": "Xin Fu Zhou",
        "descriptionShort": "Well-executed ding bian hu served all day.",
        "descriptionFull": "Silky texture, clean broth, and consistent toppings make this a reliable pick for first-timers and regulars alike. They keep the soup clear and soothing. A splash of vinegar brightens the finish.",
        "address": "93250 Kuching, Sarawak",
        "operationTime": "6am – 10pm daily",
        "map": "https://maps.app.goo.gl/NTb5wuc5TpLiwD496"
      }
    ]
  },
  {
    "id": "laksa",
    "name": "Laksa",
    "state": "Sarawak",
    "thumb": "../image/laksa.jpg",
    "desc": "Noodle soup from the state of Sarawak",
    "tags": ["noodles", "spicy", "soup"],
    "halal": false,
    "image": "../foodImage/laksa_1.jpg",
    "introImages": [
      "../foodImage/laksa_2.jpg",
      "../foodImage/laksa_3.jpg"
    ],
    "description_1": [
      "Sarawak Laksa is a distinctive spicy noodle soup known for its rich, aromatic broth made with sambal belacan, tamarind, and coconut milk. The soup base combines savory, sour, and spicy elements in harmony.",
      "Typically served with thin rice vermicelli, shredded chicken, prawns, bean sprouts, and topped with fresh coriander, lime, and sometimes sambal on the side.",
      "Its origins go back to the Foochow community in Sarawak, making it a cultural and culinary icon enjoyed by many."
    ],
    "description_2": [
      "The preparation involves slow simmering of spices and seafood to achieve a complex, layered flavor profile.",
      "Its tangy and spicy notes awaken the palate, while the toppings provide various textures and freshness to every bite.",
      "Sarawak Laksa defines the local palate's love for robust, flavorful dishes and is often cited as a must-try when visiting Kuching."
    ],
    "ingredients": [
      "Rice vermicelli",
      "Sambal belacan",
      "Tamarind",
      "Coconut milk",
      "Chicken",
      "Prawns",
      "Bean sprouts",
      "Coriander"
    ],
    "places": [
      {
        "image": "../places/farley.webp",
        "name": "Farley Mall Cafe",
        "city": "Kuching",
        "viewMap": "Farley Mall",
        "descriptionShort": "Aromatic Sarawak laksa with layered spices.",
        "descriptionFull": "Coconut-tamarind broth is bold yet balanced, with vermicelli, chicken, prawns, and fresh herbs. A satisfying, all-day laksa. Broth shows a gentle coconut sheen without excess oil. Herbs stay fresh and lively on top.",
        "address": "Farley Mall Cafe, 93250 Kuching, Sarawak",
        "operationTime": "8am – 9:30pm daily",
        "map": "https://maps.app.goo.gl/xixAJHWwL2MzhUyw7"
      },
      {
        "image": "../places/hakGuan.jpeg",
        "name": "Hak Guan Cafe",
        "city": "Kuching",
        "viewMap": "131, Hak Guan",
        "descriptionShort": "Well-balanced laksa with bright, tangy notes.",
        "descriptionFull": "A clean, spice-forward broth complemented by crisp sprouts and a squeeze of lime. Comforting and lively in equal measure. Heat level is moderate with sambal on the side to tune it. Prawns are cleaned well and keep a firm bite.",
        "address": "No,131, Batu 4, 1/2, Jalan Penrissen, penrissen, 93250 Kuching, Sarawak",
        "operationTime": "5:30am – 1pm daily,Tue rest",
        "map": "https://maps.app.goo.gl/N6E5mbArwBdGaX5M9"
      },
      {
        "image": "../places/rempahRatus.jpg",
        "name": "Rempah Ratus",
        "city": "Kuching",
        "viewMap": "65, Rempah Ratus",
        "descriptionShort": "Punchy, fragrant laksa with generous toppings.",
        "descriptionFull": "Rich, warming broth clings to vermicelli, while prawns and chicken add body. A hearty bowl for spice lovers. Soup coats the noodles for satisfying slurps. Coriander and lime make a fragrant finish.",
        "address": "No. 65, Survey Lot 26, Lorong 2A1A, Jalan Pines Square, Jalan Batu Kawa, 93250 Kuching, Sarawak",
        "operationTime": "10am – 10pm daily",
        "map": "https://maps.app.goo.gl/g48HXo4SXU9S2g3T7"
      }
    ]
  },



  {
    "id": "chickenriceball",
    "name": "Chicken Rice Ball",
    "state": "Melaka",
    "thumb": "../image/ChickenRiceBallThumbnail.jpg",
    "desc": "Fragrant chicken-flavored rice is hand-rolled into compact, bite-sized balls",
    "tags": ["rice", "chicken"],
    "halal": true,
    "image": "../foodImage/chickenricebowl_1.jpg",
    "introImages": [
      "../foodImage/chickenricebowl_2.jpg",
      "../foodImage/chickenricebowl_3.jpg"
    ],
    "description_1": [
      "Melaka Chicken Rice Bowl is a classic dish featuring tender poached chicken served on fragrant chicken rice. The rice is cooked in rich chicken broth, infusing every grain with flavor.",
      "Accompanied by boiled vegetables and seasoned chili and ginger sauces, the dish is simple yet deeply satisfying.",
      "It reflects Melaka’s culinary traditions where subtle flavors and quality ingredients shine."
    ],
    "description_2": [
      "The perfect Chicken Rice Bowl balances moist chicken with aromatic rice and complementary condiments.",
      "Every bite offers a comforting blend of textures and tastes, making it a popular meal throughout the region.",
      "Locals and visitors alike enjoy this dish as a hearty breakfast or light lunch option."
    ],
    "ingredients": [
      "Chicken",
      "Chicken broth rice",
      "Chili sauce",
      "Ginger sauce",
      "Boiled vegetables"
    ],
    "places": [
      {
        "image": "../places/hoeKee.jpg",
        "name": "Hoe Kee Chicken Rice Ball",
        "city": "Melaka",
        "viewMap": "468,Hoe Kee",
        "descriptionShort": "Iconic rice balls with juicy poached chicken.",
        "descriptionFull": "A Melaka staple where fragrant rice is shaped into bite-size balls and paired with tender chicken. Chili and ginger dips complete the experience. Queueing is efficient and moves steadily. Rice balls are compact and don’t crumble.",
        "address": "468, Jalan Hang Jebat, 75200 Melaka",
        "operationTime": "9am – 4:30pm daily, Thu rest",
        "map": "https://maps.app.goo.gl/HH9C8eAeeaJybkBC7"
      },
      {
        "image": "../places/eeJiban.jpg",
        "name": "Ee Ji Ban Chicken Rice Ball Halal Melaka",
        "city": "Melaka",
        "viewMap": "275, Ee Ji Ban",
        "descriptionShort": "Halal-friendly rice balls with well-seasoned chicken.",
        "descriptionFull": "A popular choice for families, serving moist chicken, aromatic rice balls, and balanced sauces in a comfortable setting. Sauces are balanced and not overly salty. Seating is comfortable for families.",
        "address": "275, Jalan Melaka Raya 3, Taman Melaka Raya, 75000 Melaka",
        "operationTime": "12pm – 5pm daily, Thu rest",
        "map": "https://maps.app.goo.gl/XtwmxtqJ6V69hbmP7"
      },
      {
        "image": "../places/oldtown.jpg",
        "name": "OldTown Chicken Rice Ball, Taman Malim Jaya",
        "city": "Melaka",
        "viewMap": "23, OldTown",
        "descriptionShort": "Classic chicken rice balls in a nostalgic space.",
        "descriptionFull": "Consistent flavor and gentle seasoning make this an easy everyday option. Simple, tidy plates with quick service. Service is friendly and fast. The roast chicken option adds a light char.",
        "address": "23 Jalan Tengkera, Melaka",
        "operationTime": "8am – 5pm daily, Thu rest",
        "map": "https://maps.app.goo.gl/rVmZA3hYRdWD5Z8Y9"
      }
    ]
  },
  {
    "id": "cendol",
    "name": "Cendol",
    "state": "Melaka",
    "thumb": "../image/cendol1.jpg",
    "desc": "Refreshing Malaysian dessert",
    "tags": ["dessert", "sweet"],
    "halal": true,
    "image": "../foodImage/cendol_1.jpg",
    "introImages": [
      "../foodImage/cendol_2.jpg",
      "../foodImage/cendol_3.jpg"
    ],
    "description_1": [
      "Cendol is a quintessential Malaysian dessert combining shaved ice, coconut milk, green rice flour jelly, and palm sugar syrup. The refreshing mix makes it perfect for hot climate relief.",
      "Served with optional toppings like red beans, sweet corn, and grass jelly, it is a colorful and flavorful treat.",
      "In Melaka, cendol vendors blend traditional recipes with local ingredients, resulting in unique and tasty variations."
    ],
    "description_2": [
      "The key to great cendol lies in the smoothness of the jelly and the richness of the coconut milk.",
      "The sweetness is balanced by the earthiness of palm sugar, creating layers of depth in every spoonful.",
      "Enjoyed year-round, it remains a popular dessert at markets and roadside stalls across Melaka."
    ],
    "ingredients": [
      "Shaved ice",
      "Coconut milk",
      "Rice flour jelly",
      "Palm sugar syrup",
      "Red beans",
      "Sweet corn"
    ],
   "places": [
      {
        "image": "../places/jonker88.webp",
        "name": "Jonker 88 Cendol",
        "city": "Melaka",
        "viewMap": "88,Jonker",
        "descriptionShort": "Creamy, gula-Melaka-rich cendol in a lively spot.",
        "descriptionFull": "Silky coconut milk, chewy green jelly, and deep palm-sugar syrup create a balanced, refreshing bowl. A must on hot afternoons. Ice is shaved fine so it melts evenly. The green jelly keeps its bounce to the last spoon.",
        "address": "88 Jalan Hang Jebat, Melaka",
        "operationTime": "9:30am – 7:30pm daily",
        "map": "https://www.google.com/maps/place/Jonker+88+Cendol"
      },
      {
        "image": "../places/kampungHulu.jpg",
        "name": "Cendol Kampung Hulu",
        "city": "Melaka",
        "viewMap": "26,Kampung Hulu",
        "descriptionShort": "Traditional cendol with fragrant coconut milk.",
        "descriptionFull": "Smooth jelly and fresh toppings meet aromatic gula Melaka. Sweetness is measured, making it easy to finish the bowl. Palm‑sugar syrup is cooked daily and smells amazing. Bowls are modest—easy to finish.",
        "address": "26, Jalan Kampung Hulu, Kampung Hulu, 75200 Melaka",
        "operationTime": "11am –11:30pm daily",
        "map": "https://maps.app.goo.gl/3Lyk67YDWyk1VGc66"
      },
      {
        "image": "../places/jamBesar.jpg",
        "name": "Cendol Jam Besar Bandar Hilir Melaka",
        "city": "Melaka",
        "viewMap": "Jam Besar Bandar",
        "descriptionShort": "Fun, plate-served cendol with varied toppings.",
        "descriptionFull": "A playful presentation with classic flavors: rich coconut, molasses-like syrup, and ice-cold refreshment near the iconic clock tower. They sometimes add red beans or corn for variety. The towering shaved‑ice mound is very photogenic.",
        "address": "Hdn.Menara.Jam Besar, Banda Hilir, 75000 Melaka",
        "operationTime": "10am – 7:30pm daily",
        "map": "https://maps.app.goo.gl/ypasQn2TFX585YuGA"
      }
    ]
  },
  {
    "id": "popiah",
    "name": "Popiah",
    "state": "Melaka",
    "thumb": "../image/porklardpopiah.jpg",
    "desc": "Spring roll from Melaka",
    "tags": ["snack", "roll"],
    "halal": true,
    "image": "../foodImage/popiah_1.jpg",
    "introImages": [
      "../foodImage/popiah_2.jpg",
      "../foodImage/popiah_3.jpg"
    ],
    "description_1": [
      "Popiah is a fresh spring roll filled with shredded vegetables, eggs, and optionally meat or prawns. It’s lightly dressed with sweet sauce and topped with crushed peanuts.",
      "Known for its thin skin and refreshing filling, Popiah is a popular snack across Melaka, enjoyed by all age groups.",
      "Often eaten during festivals and daily at local markets, it highlights the abundance of fresh produce in the region."
    ],
    "description_2": [
      "The roll’s delicate wrapper requires skill to make thin and elastic, ensuring a perfect textural contrast with crispy and tender fillings.",
      "Sweet and savory sauces elevate the fresh ingredients, making every bite flavorful.",
      "Popiah is a testament to Melaka's rich food culture blending local ingredients with multicultural influences."
    ],
    "ingredients": [
      "Thin crepe skin",
      "Shredded turnip",
      "Eggs",
      "Carrots",
      "Prawns or meat",
      "Sweet sauce",
      "Crushed peanuts"
    ],
     "places": [
      {
        "image": "../places/pohpiahLwee.jpeg",
        "name": "Poh Piah Lwee",
        "city": "Melaka",
        "viewMap": "14, Lwee",
        "descriptionShort": "Thin-skinned popiah with fresh, well-seasoned filling.",
        "descriptionFull": "Soft crepes wrap crunchy vegetables, egg, and peanuts with a light, sweet-savory sauce. Balanced textures in every bite. A thin layer of sweet sauce avoids sogginess. Jicama and lettuce keep the texture crisp.",
        "address": "14, Jalan Kubu, 75300 Melaka",
        "operationTime": "9am – 4pm daily, Mon & Tue rest",
        "map": "https://maps.app.goo.gl/YAHE5s7gfJDYH5KUA"
      },
      {
        "image": "../places/popiahtaChong.jpeg",
        "name": "Popiah Ta Chong",
        "city": "Melaka",
        "viewMap": "145, Ta Chong",
        "descriptionShort": "Hand-rolled popiah with classic sweet sauce.",
        "descriptionFull": "A tidy roll that’s juicy without being soggy, finished with peanuts for richness and crunch. Great as a light snack or side. Tight wrapping prevents spills. A dash of fried shallot oil warms the flavors.",
        "address": "145, Jln Tengkera, Taman Kota Laksamana, 75200 Melaka",
        "operationTime": "10am – 3pm daily",
        "map": "https://maps.app.goo.gl/TnBQ9ui8PruSm4z59"
      },
      {
        "image": "../places/bungaRaya.jpg",
        "name": "Bunga Raya Popiah",
        "city": "Melaka",
        "viewMap": "124, Bunga Raya",
        "descriptionShort": "Generous fillings and satisfying crunch.",
        "descriptionFull": "Known for well-stuffed rolls and a pleasing sweet-savory profile. Ideal for a quick takeaway while exploring town. Portions are generous and good for sharing. You can request no peanuts if needed.",
        "address": "124, Jalan Munshi Abdullah, Kampung Jawa, 75100 Melaka",
        "operationTime": "10:30am – 7pm daily",
        "map": "https://maps.app.goo.gl/QttyG6STQHtNx7ka7"
      }
    ]
  },
  {
    "id": "satay",
    "name": "Satay",
    "state": "Melaka",
    "thumb": "../image/satay.jpg",
    "desc": "Marinated pork or chicken skewers grilled over charcoal",
    "tags": ["grilled", "skewers", "meat"],
    "halal": true,
    "image": "../foodImage/satay_1.jpg",
    "introImages": [
      "../foodImage/satay_2.jpg",
      "../foodImage/satay_3.jpg"
    ],
    "description_1": [
      "Satay consists of marinated meat skewers grilled over charcoal and served with a rich, spicy peanut sauce. Melaka Satay is known for its tender meat and flavorful seasoning.",
      "The skewers are usually chicken, beef, or lamb, seasoned with local spices and herbs creating a smoky and aromatic dish.",
      "Satay is a popular street food, enjoyed as a snack or main dish, celebrated for its irresistible combination of texture and flavor."
    ],
    "description_2": [
      "Accompanied by sliced onions and cucumbers, and sometimes ketupat (compressed rice cakes), satay delivers a complete feast in every bite.",
      "The peanut sauce is thick, fragrant, and slightly sweet, complementing the savory grilled meat perfectly.",
      "This food reflects Melaka’s rich street food culture and is a favorite for communal dining experiences."
    ],
    "ingredients": [
      "Chicken, beef or lamb",
      "Skewers",
      "Peanut sauce",
      "Onions",
      "Cucumbers",
      "Spices"
    ],
    "places": [
      {
        "image": "../places/capitol.jpg",
        "name": "Capitol Satay Restaurant",
        "city": "Melaka",
        "viewMap": "30, Capitol",
        "descriptionShort": "Famous satay celup with thick, nutty gravy.",
        "descriptionFull": "Choose your skewers and cook them in bubbling peanut sauce at the table. Social, fragrant, and unmistakably Melakan. Skewers include seafood and vegetables beyond the usual meats. The sauce thickens as you dip, becoming richer over time.",
        "address": "30, Jalan KPKS 3, Kompleks Perniagaan Kota Syahbandar, 75200 Melaka",
        "operationTime": "5pm – 2am daily",
        "map": "https://maps.app.goo.gl/CgFvPMpWXwGmvQTV8"
      },
      {
        "image": "../places/McQuek.jpg",
        "name": "McQuek's Satay Celup Melaka (Cawangan Utama)",
        "city": "Melaka",
        "viewMap": "288,McQuek",
        "descriptionShort": "Well-known satay celup with bold peanut aroma.",
        "descriptionFull": "A lively venue for dipping assorted skewers into a rich, warming gravy. Great variety and steady crowd energy. Staff will refresh the pot if it gets too thick. Choices span fish balls, tofu and mushrooms.",
        "address": "Kampung, 288, Jln Parameswara, Bandar Hilir, 75000 Malacca",
        "operationTime": "4pm – 11pm daily, Wed rest",
        "map": "https://maps.app.goo.gl/BXKz9y6kNNM8Hv3n6"
      },
      {
        "image": "../places/suuKee.jpg",
        "name": "Suukee Satay",
        "city": "Kota SyahBandar",
        "viewMap": "36,Suukee",
        "descriptionShort": "Juicy charcoal-grilled satay with classic sides.",
        "descriptionFull": "Tender chicken and beef skewers pair with chunky peanut sauce, cucumber, and onion. Smoky, lightly sweet, and very snackable. Char marks are pronounced without bitterness. Ketupat is fresh with a pleasant firmness.",
        "address": "36, Jln KPKS1, Kompleks Perniagaan Al-azim, 75200 KOTA SYAHBANDAR, Melaka",
        "operationTime": "11am – 6pm daily, Mon rest",
        "map": "https://maps.app.goo.gl/2o42KcgGzVrMcnQn9"
      }
    ]
  }
]
